Terraform plan in __Deployment/terraform__
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.app_package will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_package"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "SX7ur5D7q2CBVOh09WycDYmdMIJt8UPU/dMyV9HzyIU=" -> (known after apply)
      ~ output_md5          = "786fa620873873451c99fb84b209a481" -> (known after apply)
      ~ output_sha          = "3f1ce539f69b9855829d2071db6edf084fd3b77a" -> (known after apply)
      ~ output_size         = 7414 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.icebreaker will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "icebreaker" {
        id                       = "/subscriptions/36fd3843-f200-408f-a432-9bd04c5af9be/resourceGroups/rg-Icebreaker-int-01/providers/Microsoft.Resources/deployments/icebreaker-deployment"
        name                     = "icebreaker-deployment"
      ~ parameters_content       = (sensitive)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ appDomain      = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ appServiceName = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                }
              ~ parameters     = {
                  ~ appDescription      = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ appIconUrl          = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ appName             = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ botAppID            = {
                      ~ type      = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ botAppPassword      = {
                      ~ type      = "SecureString" -> "securestring"
                        # (2 unchanged elements hidden)
                    }
                  ~ gitBranch           = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ gitRepoUrl          = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ location            = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingDayOfWeek    = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingHour         = {
                      ~ type          = "Int" -> "int"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingStartKey     = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingTimeZone     = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingWeekInterval = {
                      ~ type         = "Int" -> "int"
                        # (3 unchanged elements hidden)
                    }
                  ~ planSize            = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ sku                 = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ tenantId            = {
                      ~ type         = "String" -> "string"
                        # (4 unchanged elements hidden)
                    }
                    # (1 unchanged element hidden)
                }
              ~ resources      = [
                    # (1 unchanged element hidden)
                    {
                        apiVersion = "2016-09-01"
                        location   = "[parameters('location')]"
                        name       = "[variables('appHostingPlanName')]"
                        properties = {
                            hostingEnvironment = ""
                            name               = "[variables('appHostingPlanName')]"
                            numberOfWorkers    = 1
                        }
                        sku        = {
                            capacity = 0
                            family   = "[variables('skuFamily')]"
                            name     = "[variables('skuName')]"
                            size     = "[variables('skuSize')]"
                            tier     = "[parameters('sku')]"
                        }
                        type       = "Microsoft.Web/serverfarms"
                    },
                  ~ {
                      + scale      = null
                        # (9 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (7 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (7 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (8 unchanged elements hidden)
                    },
                    {
                        apiVersion = "2019-09-01"
                        dependsOn  = [
                            "[concat('Microsoft.Web/sites/', variables('appServiceName'))]",
                        ]
                        location   = "[parameters('location')]"
                        name       = "[variables('keyVaultName')]"
                        properties = {
                            accessPolicies               = [
                                {
                                    objectId    = "[reference(resourceId('Microsoft.Web/sites', variables('appServiceName')), '2018-11-01', 'Full').identity.principalId]"
                                    permissions = {
                                        secrets = [
                                            "get",
                                        ]
                                    }
                                    tenantId    = "[subscription().tenantId]"
                                },
                            ]
                            enabledForTemplateDeployment = true
                            sku                          = {
                                family = "A"
                                name   = "Standard"
                            }
                            tenantId                     = "[subscription().tenantId]"
                        }
                        type       = "Microsoft.KeyVault/vaults"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (3 unchanged elements hidden)
            }
        )
        # (5 unchanged attributes hidden)
    }

  # local_file.logo["color.png"] will be created
  + resource "local_file" "logo" {
      + content_base64       = "iVBORw0KGgoAAAANSUhEUgAAAMAAAADACAYAAABS3GwHAAAACXBIWXMAAAITAAACEwGa0+JEAAAOiklEQVR4nO2dv29jSxXHx4iC5pGloETJk5AQ1QbJoiR+HQXS80rwCpp4JWRRIG2eBBLdejsESJtt3eD8AWgdgWg3Fq2ll9C96tkdEs0aKgp00ay+k52cnftj7r2+tud8P1K0m2vnXu/mfGfOOXNmTi/LMkOIVr7G3zzRDAVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENV8Xft/gKTXnz4yxpwaYwZ4yf79kfe2lf+VLcc3u//UpC69LMvU/+f1+tMTY8zQGDMyxjyucYtrY8zcfmXL8dstfESyJVQLoNef2lF+Yow5a/G2V8aYGWeGw0ClALZk+JKFfQaFsN+oEgD8+0tjzHnJW9fGmFvvS7o1Lk44QaxwXHCvVxACXaM9RI0AMOrPCozV+fE32XK8iry3iyEucu5vBTXibLB/qBBArz+1we2fAi9tMCNctjVCl7hXn2fL8WUbzyHtkLwAev3pLMfl+dIY8+PY0T7iuUPMOEfipatsOR5t45kknqQXwnr9aZG//z2M1FshW47niBGuxf3PIUqyByQ7AxS4PZKtuyW9/tQK7bm4zJlgD0hyBoAfXsX4DQLXrZItx1YAT8UzziEMskOSEwBSnfOIHylKYbZGthzPAiJ4DrGSHZHiDBAKPPcCiOCV+CxziJbsgKQEgNH0U3H5y5Ifk0HqVsmWY+ty3XnPOEIqluyA1GYAmV2xhvbbkp+pZXx28csKrqYLM8QahOOcrtBuSEYAyPpIf/4C6cirnB97Wmd1FmnMr4wxb+xXrz9dYTW4Elh7kMJjQLwDUpoBZEpx4Ywb6cYXKEkw+PMJfPIokLmRawvHNbJJl2IWOOMs0D1JbIjB6CtLDx6MsEhFtjHK5hn6acxNbOkFFur89QErVNYLdUgqM4Ac/TdwfbZBXoapTkmFdIPOmRHqllS2RA7F9++MHy7FhcgMrTHKtr1pJfpemAWuhEs1DATzZEsc/AyAEVNuY5wjUH0TSIsew+Bs8HrT60+jXBcvjvC5qxNPuM8qvpdiJlskBRcoZMCfBQLVO+zSWnjXbNzwRa8/jQlg5Xs3ARcsBjlzMBDukIMvhoPxvvQu/csY823ve2ugQ+nuoFz5wgueKxenwbUaYKfYrOlegl5/eitmsY+3VaZNHpJCDCCDxo/E94NsOb6VP4QgeQ4BTRCArpAtKgRiajN+kAI4qRlUk0hSFMA3vL9fhYzfx5ZC21gABm2L0+yWSBcbDAJnAkVvmayAvN8p06HdkIIAioLYSmUOViRwiWzQPOv1p0asKq89I530+tO3yNQ0dn+AFABToR2R8o6wddno7wO3ZgHDP0bs8AL++Em2HA/w5TbAW+GtIJym0N3ZESkIIM94Yk92mInVZGv0k5C7Y68hYLbxwmvUIZEDJGUBVAaBsEubulLl0nQktlLa9182XMGtXEhH2kX96dCoI3KZnzUMPya3P0d5RJNZQAqALlFHpCCAptmSiVffc4Gg1rpDn0aO6k1iAfkcCqAjVLtAMHBnuGuvgM6JqquyBJnJqhy8k2YcvAAQpIbqc6rU+Ay80d+vyXECqHKPNvx3P/he8xzR7kglBgi5QUcVdmn5Bn5/DxjgpqIA3CxRayYKpFG5ANYhqQggr/a/zID9TI80vNuy0R3G62aQuoZLAeyQJAQA330TeKlqZeVdjttRFgT7mZ/oDTgiBql9H1KflNKgIcMpC2JdsBka6c+KglG4V26vwVVNv30kdpjVvQ+pSUoCCFVxHpdseHHuxoN4wfPLi0ZjfwNM9F5jjP5ybwF3gnVMMgJANih0/EnuAhVcJ5dBkga9yTNICOR+H4F9hi2lsNcj1g5kM40FG2h0T1KnQ2MU/0pc/ne2HOcelYgZ4gauiBPDo9AmGvN+5F7h/Ru4TyOxKecO95zn3MM+8wtx+RMKoHuSKoXALCDP3vxmUbEaKkYHGMlX8PsHBcY49/z2EXx26SrZzS3PCsqx5cxyTePfDSk2yp4g+PXdi98X+dcQQWktj6gYfeVWjq3wev3pOnAy3QfPxFlAchM/V353RJINMrBn9424/MdsOf5Ng3v6rZbsiD0seN3nqX9iRE7jjjvMOtEZIK+zvexo73jX5ZIzTJiUO8TIzfL2H/qTbDn+W417zUS59AfGisD4dc4tWhUBnjWs0KJVsvA62qsvuDOpN8kLjMr/M8b0q+4UC/QVzjVSvPcG2Z154AS5RiJA4HwBw2+j/4EVw6zBeUZJoLFL5H+NMb8s+8XD4Gaevx5zbIoTg/T1a4kgot9ZHdbeKdrq0NInOOSfX+MX/4ErgED1Gb7dINsTZSBbEEHo37DBM1xX+7yO9qei8jXEAv9OVa6Rpk7xvlE7XKPsmfvFC4O88jbJ1Hlm2yK4hAvk1hhiRVnmRtUS+yGjRgDmvaFd5vzyr70AsbLBY/Ft6J0hdOMfrtW2CNrAK8O4yPm/eIVWTsmjSgDmvcHKEyAkd96imAmUKJ9iBXgQMGyDsob7StR9FIF5KATZw9ho6WOsTgAOpBIvt9gmVRp3ExGsUZphD/A6jTnvqApwjeaB/4vkRaBWAA4Y3KhkRqjKBoYUPE+ooQg2mJXe+rNLW+CzzQLHySctAvUCcHi+/DBSDOuYoLShCN6RLce9iM8XRU626Wmq6wUUQA5wCx7l7CpzKcfbBuULIRE88UVUIIKtVo7miOAHbbte+0CKxXCt4P2yWzc0tEaaBwQg3aY5ivukbz70PxcENUBwfts0jWldHhwQ7ItgFtsI8BBQfzLcDpHG9CIwwsrj2f3r78AssUId0nOcVbpqoeWq7Gj/GC1ik4Iu0A4IVKvaOOI0z53yehUMvCD1W/hzVbDC+6TJbCA2CzmS6l5DAewANOTwA+2oIBMCWkEQRTVCaxznXptAVW1SWSEKoGNCo39dI4VLElrE8qkdvNrMGDb7rEQckswswCC4e+To2cSvrpKBijq2XS4Q9vpTGwf8yhjzF+9tFwUd8w8KBsEdgmyNTC82ydiUZqhi0qVYC3ktRnubqfquOH81GReIAugWeVBXo4Ow4NrcFbwldExMEXmGfSpmqqOWWkPtHAqgW2Rqso01hlHOsZCbGu5VXuo0dPJFEg29KYBukUbTuO7eO9bFnwnWqCCNDVRz+61hprr2rnEGINWB//+g9WpbJc5WBNlybN2Uj5H1OamZ+QnNSP4Jef7rxw37ou0FFEB3yJXf1tOI6F5Zu14HaxEybvB3xMl7H3xpBNOg3SFz/a3VGAWOSdl4+4Rnkf2SR6hTOpHHp6CDvv/2g+9oTwF0R+utUOGCzAPl20e4Zr+e9frTBfYoVDLWiPIJukBkp1wK498gUH2BM1IXuG7f8wab6ptSlHY9ODgDHChwe/xFtQW2TcoT6/wN8M9QijFASfYQaVT/yJQN/n4HF+pSuFD+/Q8+FcoZ4HDxR/N1yPgN9h7glIoTiMSu7M5RkPca1aVzVI72suX4EXacuYK7G/Q+cO5OUnsCOAN0R2unOqBM2U+pTspSqnh9IHZ7bfL6IOD9EwjljXcKhl8affAH7nIG6I42U4hNVpT9547KAmO8blOjZ73+9NdxH3P/oQC6Q+b9mwjgQfal6oovyqfdNkzrNlUtlXAi+Zm4fvAN/SiAjoCR+jU7xxUaebeNK2G+QvD7uKh7jocT2A/F9YPfJE8BdIt0NzrLooim3jO4NjYovmxQ0kABkCjkAlPduvoHLk9JK1jHffGa5/dPIIqywraQQPKaix8UFEC3SAGc1XSDQmeVluGec7+QBSGsK+zuCt0/iZZLFECHYMSUxWbRWyIRTyy8S1VcKbdiLEftOWKBIiF+FriWxElxFED3SMM5r+jCSPz7xNTmy4yR8+ODAkB88H1x+S6VU+IogI7xgk+f6BodlC67fbpVtijm1fCUpVB/HrjWRk3RXkAB7Abp9pzh/J1Y/PuU/bwbsaW75Eb+vID2d+L7dUoH5VIAO8BbXfV5GXucoZgFygJqZ7THYrawz9yEXBqI8iNxOanOMRTA7rgIbGaf14gHJjl/f4AQnS1usxtfRqgL+sClgZj+IC4vUusfxpPhdkhOR/sNypUrB5niqMXCo9MDR59/cNQhAt9/GGO+Iz7XSQq5fx/OADsEhvpCfIIjlCDHLJL5I39hgApjt5vnP8EG+pDx/10Yv8krtz50OAPsATkNKQx2dZWWOpsP28B+ni3H0Zmagl5hyXaI4QywB2AUDp3iZg36tmJwPPFSnS9jYwkEvDc5jfKSNH7DGWC/KJgJDNYOCje2I3C9hRtV2HNA/Exe29jk+wVTAHtG4Dx+yQLVnMFRWTS1yO0xXNIj2KTs9vhQAHsIXJ5ZSQ9j15J1ju7090YufPkHIsBrFyifCHWW+Y8x5kcpNsQLQQHsKRihJ15gW8YdRv5br8u9DYR/aoz5qzHmnzD6IlH92RjzixSzPXlQAHsOZoNJS42884g6OCslKIADAUIYFQTJdbjGuT/qDN9BARwYcI3cWaCf1vj0Cxc7pNTtsS4UwIGDoPYUVZ0noq7/rehqr3akz4MCIKrhSjBRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBENVQAEQ1FABRDQVAVEMBEL0YY/4PbO7/OwaNNk4AAAAASUVORK5CYII="
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/color.png"
      + id                   = (known after apply)
    }

  # local_file.logo["outline.png"] will be created
  + resource "local_file" "logo" {
      + content_base64       = "iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAYAAABzenr0AAAACXBIWXMAAACxAAAAsQHGLUmNAAACvklEQVRYha1XsY7UMBB9rK6gIyWiufzBhZqC7WiQSEmDlPqq+wPyCeEDTqSiDn+QFT+QnmaRKCg4CEgnCiQGzfHmmDPOcrIz0mwc79h+8zyecSAiMW1EZBCRWf7KJCKdiFQLY5L0jv442QLoARwD+ABgoqqUAGoA9wC8BdAAmJErDvUpff0uIvUBbxoys1+DDWts5aZ0/xlYcksURLEGAJ3o0kHYRozDvpJMDLkAGi7a0POziGFHmz7ob9mfvBUbBtY3Blnl1Iu9h0HXcWyTHIqk8SOfDRnYs+3pbxf2e6QmMXDEY6X6ikcQfI48liXbMQbA/16mErBx7cG1lfITLqggWrbPUhc6BGDHduH6OyYbHwsT4yWUrZsjCYBluieu/4TeegC1szUpaBP23154nlU+u+CwLDfxvWCQPg8CMfsYWuONiPwSkad8rxjZFRe0QjS5RLVaIjIPLzmh99AWNyY62uj7MZ+zY6CizRhU0X4hu94oRjr4B+mvXb4P60J1AETrWGmpvqyPYS4JERUO/T4ykfB5CEQsWRUOnGfsHwA+8/UOzMx2R2aWmJCFWhKyd11Fk4OHOri4aQL6p4V9NxB9LoDKVVHfX7oAnCPj1P6c/5c5AKxEx/bc4qWNbK2JbkN3lJzB/mTA3UKBaqh90G+2O2bPKoeBmIemtTt6gwtcuJNylUVzGFgS9fw1gIf0csuSbfViInvv9SUHwI6Th1I6isHFrdJaNdVx53qb2kQmuK3oAo+DMm7i+wxkSTV5oOByAFiAhZeUkeXcFqvY17u74wsAd68uQSskotg1fnQBWvHItcwBmjV/isinNTJh4fJ7eImdXfTXTNFqf+FB5wLwHlq1MzYsHRcOxBfandr48OM0VTTodI+fcQL9sNV9vw/gAsAjfvB+pc2764VWYCBkw9+crB5orIQ1AyKC38yyWULyQOf/AAAAAElFTkSuQmCC"
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/outline.png"
      + id                   = (known after apply)
    }

  # local_file.manifest will be created
  + resource "local_file" "manifest" {
      + content              = jsonencode(
            {
              + $schema          = "https://developer.microsoft.com/en-us/json-schemas/teams/v1.5/MicrosoftTeams.schema.json"
              + accentColor      = "#1037A6"
              + bots             = [
                  + {
                      + botId              = "a08bcffb-7f2c-47c6-9990-a38613d7d575"
                      + isNotificationOnly = true
                      + scopes             = [
                          + "personal",
                          + "team",
                        ]
                      + supportsFiles      = false
                    },
                ]
              + description      = {
                  + full  = "Icebreaker ist ein niedlicher kleiner Bot, der jede Woche nach dem Zufallsprinzip Zeichensetzende zusammenbringt, um zu helfen, Vertrauen und persönliche Beziehungen aufzubauen."
                  + short = "Bringt Zeichensetzende nach dem Zufallsprinzip zusammen."
                }
              + developer        = {
                  + name          = "Zeichen gegen Mobbing"
                  + privacyUrl    = "https://zeichen-gegen-mobbing.de/datenschutz"
                  + termsOfUseUrl = "https://zeichen-gegen-mobbing.de/impressum"
                  + websiteUrl    = "https://zeichen-gegen-mobbing.de"
                }
              + icons            = {
                  + color   = "color.png"
                  + outline = "outline.png"
                }
              + id               = "a08bcffb-7f2c-47c6-9990-a38613d7d575"
              + localizationInfo = {
                  + defaultLanguageTag = "de"
                }
              + manifestVersion  = "1.5"
              + name             = {
                  + short = "Icebreaker"
                }
              + packageName      = "de.whitetom.zgm.icebreaker"
              + permissions      = [
                  + "identity",
                  + "messageTeamMembers",
                ]
              + validDomains     = [
                  + "icebreaker-pyvgcb633ehza.azurewebsites.net",
                ]
              + version          = "1.0.0"
            }
        )
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/manifest.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #22](https://github.com/WhiteTomX/microsoft-teams-apps-icebreaker/actions/runs/1613102929)